{
  "backend/main.mo": "Defines core types, state maps, and comparison helpers for restaurants, orders, reviews, and users, integrating authorization and user-approval logic.",
  "feature_evidence.json": "Feature evidence report mapping high‑level routing and auth requirements to the specific frontend files and components implementing them.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend pages, components, and utilities for routing, reviews, admin tools, hooks, and UI logic.",
  "frontend/index.css": "Tailwind base styles defining Foodstreet’s OKLCH color system and dark‑mode variables.",
  "frontend/index.html": "HTML entry point setting favicon, metadata, and mounting the React application.",
  "frontend/src/App.tsx": "Defines full application routing with role‑gated routes and logic for profile resolution, intended-route handling, and navigation flow.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with optional login button when unauthenticated.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Profile setup modal allowing users to enter basic info and select roles, preventing unauthorized self‑assignment of admin status.",
  "frontend/src/components/auth/RoleGate.tsx": "Guards routes by checking authentication, role permissions, and delivery partner approval before rendering children.",
  "frontend/src/components/reviews/ReviewComposer.tsx": "Allows users to rate and submit a review for an order unless they already reviewed it.",
  "frontend/src/components/reviews/ReviewList.tsx": "Displays restaurant reviews with average rating and a scrollable list of recent entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout actions, and loads persisted identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, restaurants, orders, and reviews using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and global base styles.",
  "frontend/src/layouts/AppLayout.tsx": "Provides the main app layout with authentication handling and role-based navigation links.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays the admin dashboard with navigation tiles for managing restaurants, orders, users, and delivery partners.",
  "frontend/src/pages/admin/AdminDeliveryPartnerRequestsPage.tsx": "Shows pending delivery partner requests and allows admins to approve them.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Fetches and filters all orders for admins, providing status and restaurant filters with detailed order display.",
  "frontend/src/pages/admin/AdminRestaurantsPage.tsx": "Lists restaurants grouped by status and lets admins approve, suspend, or unsuspend them.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Displays all users with role badges and profile details for admin review.",
  "frontend/src/pages/customer/CartPage.tsx": "Displays the user's cart, loads menu details, calculates totals, and allows item removal or proceeding to checkout.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Handles checkout flow with address editing, order summary, and order placement.",
  "frontend/src/pages/customer/CustomerHomePage.tsx": "Shows homepage with search and a list of popular restaurants retrieved from the backend.",
  "frontend/src/pages/customer/OrderConfirmationPage.tsx": "Displays a confirmation message and summary for a successfully placed order.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Shows detailed order status, delivery partner info, and summary with auto-refresh support.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists the user's past orders, sorted by date, and links to individual order details.",
  "frontend/src/pages/customer/RestaurantDetailPage.tsx": "Displays restaurant details, menu items grouped by veg/non-veg, reviews, and supports adding items to the cart.",
  "frontend/src/pages/customer/SearchResultsPage.tsx": "Shows restaurant search results with filters and sorting, falling back to all restaurants if no query is provided.",
  "frontend/src/pages/delivery/DeliveryDashboardPage.tsx": "Provides delivery workers with available and active deliveries, enabling acceptance and status updates.",
  "frontend/src/pages/owner/IncomingOrdersPage.tsx": "Lists incoming restaurant orders sorted by time and allows owners to update each order’s status.",
  "frontend/src/pages/owner/MenuManagerPage.tsx": "Allows restaurant owners to add, edit, and delete menu items with a simple form interface.",
  "frontend/src/pages/owner/OwnerDashboardPage.tsx": "Displays the owner's restaurants, loading and empty states, and links to manage settings, menu, and orders.",
  "frontend/src/pages/owner/RestaurantOnboardingPage.tsx": "Provides a form for owners to create a new restaurant profile and submit it for review.",
  "frontend/src/pages/owner/RestaurantSettingsPage.tsx": "Loads a restaurant by ID, allows editing its details unless in restricted status, and submits updates.",
  "frontend/src/utils/authRouting.ts": "Defines role-based landing routes and checks if a path is allowed for each app role.",
  "frontend/src/utils/intendedRoute.ts": "Stores, retrieves, and clears the user's intended redirect route using sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and modifying hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, components, animations, and enabling plugins.",
  "project_state.json": "Defines project state for the Foodstreet app, including role-based features, login routing requirements, and known login redirect bug. Lists implemented features, architectural notes, and marks the file as a fix request."
}